cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71J21.svd
            <register>
               <name>SUPC_WUMR</name>
               <description>Supply Controller Wakeup Mode Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMEN</name>
                     <description>Supply Monitor Wakeup Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The supply monitor detection has no wakeup effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The supply monitor detection forces the wakeup of the core power supply.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTTEN</name>
                     <description>Real-time Timer Wakeup Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RTTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The RTT alarm signal has no wakeup effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The RTT alarm signal forces the wakeup of the core power supply.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>Real-time Clock Wakeup Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RTCENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The RTC alarm signal has no wakeup effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The RTC alarm signal forces the wakeup of the core power supply.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBCEN0</name>
                     <description>Low-power Debouncer Enable WKUP0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPDBCEN0Select</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The WKUP0 input pin is not connected to the low-power debouncer.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The WKUP0 input pin is connected to the low-power debouncer and forces a system wakeup.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBCEN1</name>
                     <description>Low-power Debouncer Enable WKUP1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPDBCEN1Select</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The WKUP1 input pin is not connected to the low-power debouncer.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The WKUP1 input pin is connected to the low-power debouncer and forces a system wakeup.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBCCLR</name>
                     <description>Low-power Debouncer Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPDBCCLRSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>A low-power debounce event does not create an immediate clear on the first half of GPBR registers.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPDBC</name>
                     <description>Wakeup Inputs Debouncer Period</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>WKUPDBCSelect</name>
                        <enumeratedValue>
                           <name>IMMEDIATE</name>
                           <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_SLCK</name>
                           <description>WKUPx shall be in its active state for at least 3 SLCK periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_SLCK</name>
                           <description>WKUPx shall be in its active state for at least 32 SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_SLCK</name>
                           <description>WKUPx shall be in its active state for at least 512 SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096_SLCK</name>
                           <description>WKUPx shall be in its active state for at least 4,096 SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32768_SLCK</name>
                           <description>WKUPx shall be in its active state for at least 32,768 SLCK periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBC</name>
                     <description>Low-power Debouncer Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LPDBCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the low-power debouncers.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 2 RTCOUTx clock periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 3 RTCOUTx clock periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 4 RTCOUTx clock periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 5 RTCOUTx clock periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 6 RTCOUTx clock periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 7 RTCOUTx clock periods</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_RTCOUT</name>
                           <description>WKUP0/1 in active state for at least 8 RTCOUTx clock periods</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
